Repository: Seravo/wp-frontend-profile
Catalog: languages/wpptm-*.po
Languages: fi

source: Email Address
fi: Sähköpostiosoite

source: Edit your email address - used for resetting your password etc.
fi: Muokkaa sähköpostiosoitetta - sähköpostia käytetään mm. salasanojen nollaamiseen.

source: First Name
fi: Etunimi

source: Edit your first name.
fi: Muokkaa etunimeä

source: Last Name
fi: Sukunimi

source: Edit your last name.
fi: Muokkaa sukunimeä

source: Edit your profile associated URL.
fi: Muokkaa profiilisi URL-osoitetta

source: Description/Bio
fi: ﻿Kuvaus/Bio

source: Edit your description/bio.
fi: Muokkaa kuvausta

source: Password
fi: Salasana

source: New Password
fi: ﻿Uusi salasana

source: There was a problem with updating your profile.
fi: Profiilisi päivittämisessä oli ongelmia.

source: Your profile was updated successfully!
fi: Profiilisi päivitettiin onnistuneesti!

source: Password can't be empty.
fi: Salasana ei voi olla tyhjä.

source: Please make sure the passwords match.
fi: ﻿Varmista, että salasanat täsmäävät.

source: Please make sure your password is a minimum of %d characters long.
fi: ﻿Varmista, että salasana on vähintään %d merkkiä pitkä.

source: Your password must contain at least 1 uppercase, 1 lowercase letter and at least 1 number
fi: ﻿Salasanassa on oltava vähintään 1 iso, 1 pieni kirjain ja vähintään 1 numero

source: Your password was successfully changed and you have been logged out. Please <a href='%s'>login</a> again.
fi: ﻿Salasanasi on vaihdettu ja sinut on kirjattu ulos. <a href='%s'>Kirjaudu sisään uudelleen.</a>

source: Profile
fi: Profiili

source: Repeat New Password
fi: ﻿Toista uusi salasana

source: Save updated fields.
fi: Tallenna päivitetyt kentät

source: Update
fi: ﻿Päivitä

source: Extra profile information
fi: Lisätiedot

source: For security reasons this is not allowed for admin users.
fi: Turvallisuussyistä lomake on kielletty pääkäyttäjiltä.

source: You can edit your profile settings in <a href='%s'>admin panel</a>.
fi: Voit muokata profiilisi asetuksia <a href='%s'>hallintapaneelista</a>.
